---
kind: method
id: M:Autodesk.Revit.DB.ReferencePoint.GetPointElementReference
source: html/9baba8f4-1cf5-3349-a6b5-5fc8a69ba761.htm
---
# Autodesk.Revit.DB.ReferencePoint.GetPointElementReference Method

Retrieve a copy of the rule that computes the
location of the ReferencePoint relative to other elements in
the document.

## Syntax (C#)
```csharp
public PointElementReference GetPointElementReference()
```

## Returns
A PointElementReference object, or Nothing nullptr a null reference ( Nothing in Visual Basic) if the
ReferencePoint does not have a reference.